; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v5 ?v6)
		(pred_6 ?v2)
		(pred_2 ?v8)
		(pred_3 ?v8)
		(pred_1 ?v2 ?v8)
		(pred_4)
		(pred_5 ?v2))

   (:action op_2
       :parameters  (?v7 ?v3)
       :precondition (and (not-eq ?v7 ?v3) 
                          (pred_2 ?v7) (pred_2 ?v3) (pred_3 ?v7))
       :effect (and  (pred_3 ?v3)
		     (not (pred_3 ?v7))))


   (:action op_3
       :parameters (?v4 ?v1)
       :precondition  (and  (pred_6 ?v4) (pred_2 ?v1)
			    (pred_1 ?v4 ?v1) (pred_3 ?v1) (pred_4))
       :effect (and (pred_5 ?v4)
		    (not (pred_1 ?v4 ?v1)) 
		    (not (pred_4))))

   (:action op_1
       :parameters  (?v4  ?v1)
       :precondition  (and  (pred_6 ?v4) (pred_2 ?v1)
			    (pred_5 ?v4) (pred_3 ?v1))
       :effect (and (pred_1 ?v4 ?v1)
		    (pred_4)
		    (not (pred_5 ?v4)))))

; problem
(define (problem ferry-l4-c2)
(:domain ferry)
(:objects obj_05 obj_03 obj_01 obj_04 
          obj_02 obj_06 
)
(:init
(pred_2 obj_05)
(pred_2 obj_03)
(pred_2 obj_01)
(pred_2 obj_04)
(pred_6 obj_02)
(pred_6 obj_06)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_03 obj_01)
(not-eq obj_01 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(pred_4)
(pred_1 obj_02 obj_04)
(pred_1 obj_06 obj_01)
(pred_3 obj_03)
)
(:goal
(and
(pred_1 obj_02 obj_04)
(pred_1 obj_06 obj_05)
)
)

(:constraints
  (sometime-before  (pred_1 obj_06 obj_05) (pred_3 obj_04))
)
)

; plan
1. (op_2 obj_03 obj_04)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_04)
   goals met: 1 of 2
2. (op_3 obj_02 obj_04)
   deleted: (pred_1 obj_02 obj_04) (pred_4)
   added: (pred_5 obj_02)
   goals met: 0 of 2
3. (op_2 obj_04 obj_01)
   deleted: (pred_3 obj_04)
   added: (pred_3 obj_01)
   goals met: 0 of 2
4. (op_1 obj_02 obj_01)
   deleted: (pred_5 obj_02)
   added: (pred_1 obj_02 obj_01) (pred_4)
   goals met: 0 of 2
5. (op_3 obj_06 obj_01)
   deleted: (pred_1 obj_06 obj_01) (pred_4)
   added: (pred_5 obj_06)
   goals met: 0 of 2
6. (op_2 obj_01 obj_05)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_05)
   goals met: 0 of 2
7. (op_1 obj_06 obj_05)
   deleted: (pred_5 obj_06)
   added: (pred_1 obj_06 obj_05) (pred_4)
   goals met: 1 of 2
8. (op_2 obj_05 obj_01)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_01)
   goals met: 1 of 2
9. (op_3 obj_02 obj_01)
   deleted: (pred_1 obj_02 obj_01) (pred_4)
   added: (pred_5 obj_02)
   goals met: 1 of 2
10. (op_2 obj_01 obj_04)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_04)
   goals met: 1 of 2
11. (op_1 obj_02 obj_04)
   deleted: (pred_5 obj_02)
   added: (pred_1 obj_02 obj_04) (pred_4)
   goals met: 2 of 2
